# ApplicationInitialized Event

---
C#Visual BasicVisual C++
Revit 2024 API
---
ControlledApplication..::..ApplicationInitialized Event
ControlledApplication Class See Also
---
Subscribe to this event to get notified after the Revit application has been initialized
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public event EventHandler<ApplicationInitializedEventArgs> ApplicationInitialized
```

Visual Basic
---
```text
Public Event ApplicationInitialized As EventHandler(Of ApplicationInitializedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<ApplicationInitializedEventArgs^>^ ApplicationInitialized {
	void add (EventHandler<ApplicationInitializedEventArgs^>^ value);
	void remove (EventHandler<ApplicationInitializedEventArgs^>^ value);
}
```

# Remarks
The event is raised after Revit was launched as fully initialized, including initialization of external applications.
# See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace